OpenFOAM/benchmark_cases_LiPb/kOmega-case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.00661;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.00661;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform 0.00661;
    }
    probe
    {
        type            omegaWallFunction;
        value           uniform 0.00661;
    }
}


// ************************************************************************* //
